In [48]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [49]:
data = {
    'Alfred': [3.0, 4.0, np.nan, 4.0, 4.0],
    'Mandy': [np.nan, 9.0, np.nan, 3.0, 8.0],
    'Lenny': [2.0, 5.0, 8.0, 9.0, np.nan],
    'Joan': [3.0, np.nan, 9.0, 4.0, 9.0],
    'Tino': [1.0, 1.0, np.nan, 9.0, 5.0]
}

reviews = pd.DataFrame(data, index=['Michael Jackson', 'Clint Black', 'Dropdead', 'Anti-Cimex', 'Cardi B'])

reviews

                 Alfred  Mandy  Lenny  Joan  Tino
Michael Jackson     3.0    NaN    2.0   3.0   1.0
Clint Black         4.0    9.0    5.0   NaN   1.0
Dropdead            NaN    NaN    8.0   9.0   NaN
Anti-Cimex          4.0    3.0    9.0   4.0   9.0
Cardi B             4.0    8.0    NaN   9.0   5.0

In [50]:
# Creating F1 and F2
# To begin, create two randomly instantiated vectors F1 and F2 as columns in your DataFrame.

np.random.seed(42)
reviews['F1'] = np.random.normal(size = 5)
reviews['F2'] = np.random.normal(size = 5)

reviews

                 Alfred  Mandy  Lenny  Joan  Tino        F1        F2
Michael Jackson     3.0    NaN    2.0   3.0   1.0  0.496714 -0.234137
Clint Black         4.0    9.0    5.0   NaN   1.0 -0.138264  1.579213
Dropdead            NaN    NaN    8.0   9.0   NaN  0.647689  0.767435
Anti-Cimex          4.0    3.0    9.0   4.0   9.0  1.523030 -0.469474
Cardi B             4.0    8.0    NaN   9.0   5.0 -0.234153  0.542560

In [51]:
# Regression models for all users
uf = []
for c in reviews.columns[:5]:
    X = reviews.dropna(subset = [c])[['F1', 'F2']]
    y = reviews[c].dropna()
    lr = LinearRegression(fit_intercept=False).fit(X, y)
    coefs = lr.coef_
    uf.append(list(coefs))
uf = np.array(uf)

uf.shape

(5, 2)

In [52]:
# New Model for artists
ui_df = reviews.iloc[:, :-2].T
ui_df['F1'] = uf[:, 0]
ui_df['F2'] = uf[:, 1]
ui_df

,Michael Jackson,Clint Black,Dropdead,Anti-Cimex,Cardi B,F1,F2
Alfred,3.0,4.0,NaN,4.0,4.0,3.820956,3.395762
Mandy,NaN,9.0,NaN,3.0,8.0,3.710347,7.006197
Lenny,2.0,5.0,8.0,9.0,NaN,7.113263,3.952502
Joan,3.0,NaN,9.0,4.0,9.0,5.240167,10.035759
Tino,1.0,1.0,NaN,9.0,5.0,5.863280,2.197482

In [53]:
# Regression models for all artists
ifs = []
for c in ui_df.columns[:5]:
    X = ui_df.dropna(subset = [c])[['F1', 'F2']]
    y = ui_df[c].dropna()
    lr = LinearRegression(fit_intercept=False).fit(X, y)
    coefs = lr.coef_
    ifs.append(list(coefs))
ifs = np.array(ifs)

In [54]:
if_df = reviews.copy().iloc[:, :-2]
if_df.loc[:, 'F1'] = ifs[:, 0]
if_df.loc[:, 'F2'] = ifs[:, 1]
if_df

                 Alfred  Mandy  Lenny  Joan  Tino        F1        F2
Michael Jackson     3.0    NaN    2.0   3.0   1.0  0.164060  0.248037
Clint Black         4.0    9.0    5.0   NaN   1.0 -0.207666  1.421081
Dropdead            NaN    NaN    8.0   9.0   NaN  0.882355  0.436072
Anti-Cimex          4.0    3.0    9.0   4.0   9.0  1.569998 -0.429204
Cardi B             4.0    8.0    NaN   9.0   5.0  0.570041  0.670451

In [55]:
uf2 = []
for c in if_df.columns[:5]:
    X = if_df.dropna(subset = [c])[['F1', 'F2']]
    y = if_df[c].dropna()
    lr = LinearRegression(fit_intercept=False).fit(X, y)
    coefs = lr.coef_
    uf2.append(list(coefs))
uf2 = np.array(uf2)

In [56]:
ui_df2 = reviews.copy().iloc[:, :-2].T
ui_df2['F1'] = uf2[:, 0]
ui_df2['F2'] = uf2[:, 1]
ui_df2

,Michael Jackson,Clint Black,Dropdead,Anti-Cimex,Cardi B,F1,F2
Alfred,3.0,4.0,NaN,4.0,4.0,3.530467,3.433638
Mandy,NaN,9.0,NaN,3.0,8.0,4.117837,7.267461
Lenny,2.0,5.0,8.0,9.0,NaN,6.914218,4.473899
Joan,3.0,NaN,9.0,4.0,9.0,5.170728,9.367684
Tino,1.0,1.0,NaN,9.0,5.0,6.243424,1.682666

In [57]:
ifs2 = []
for c in ui_df2.columns[:5]:
    X = ui_df2.dropna(subset = [c])[['F1', 'F2']]
    y = ui_df2[c].dropna()
    lr = LinearRegression(fit_intercept=False).fit(X, y)
    coefs = lr.coef_
    ifs2.append(list(coefs))
ifs2 = np.array(ifs2)

In [58]:
if_df2 = reviews.copy().iloc[:, :-2]
if_df2.loc[:, 'F1'] = ifs2[:, 0]
if_df2.loc[:, 'F2'] = ifs2[:, 1]
if_df2

                 Alfred  Mandy  Lenny  Joan  Tino        F1        F2
Michael Jackson     3.0    NaN    2.0   3.0   1.0  0.129583  0.292646
Clint Black         4.0    9.0    5.0   NaN   1.0 -0.178546  1.350443
Dropdead            NaN    NaN    8.0   9.0   NaN  0.832828  0.501049
Anti-Cimex          4.0    3.0    9.0   4.0   9.0  1.579597 -0.456446
Cardi B             4.0    8.0    NaN   9.0   5.0  0.601892  0.668922

In [59]:
if_df.to_csv('data/Q.csv')
ui_df.to_csv('data/P.csv')

In [60]:
(ui_df[['F1', 'F2']]@if_df[['F1', 'F2']].T).T

                   Alfred     Mandy     Lenny       Joan      Tino
Michael Jackson  1.469140  2.346515  2.147366   3.348941  1.506984
Clint Black      4.032171  9.185859  4.139643  13.173421  1.905196
Dropdead         4.852237  6.329049  8.000000   9.000000  6.131757
Anti-Cimex       4.541419  2.818150  9.471380   3.919665  8.262171
Cardi B          4.454797  6.812366  6.704814   9.715601  4.815617

In [61]:
reviews

                 Alfred  Mandy  Lenny  Joan  Tino        F1        F2
Michael Jackson     3.0    NaN    2.0   3.0   1.0  0.496714 -0.234137
Clint Black         4.0    9.0    5.0   NaN   1.0 -0.138264  1.579213
Dropdead            NaN    NaN    8.0   9.0   NaN  0.647689  0.767435
Anti-Cimex          4.0    3.0    9.0   4.0   9.0  1.523030 -0.469474
Cardi B             4.0    8.0    NaN   9.0   5.0 -0.234153  0.542560

In [62]:
(ui_df2[['F1', 'F2']]@if_df2[['F1', 'F2']].T).T

                   Alfred     Mandy     Lenny       Joan      Tino
Michael Jackson  1.462328  2.660394  2.205232   3.411453  1.301465
Clint Black      4.006581  9.079066  4.807237  11.727308  1.157604
Dropdead         4.660695  7.070807  8.000000   9.000000  6.042798
Anti-Cimex       4.009446  3.187322  8.879586   3.891828  9.094049
Cardi B          4.421796  7.339858  7.154301   9.378471  4.883437

In [63]:
if_df[['F1', 'F2']]

                       F1        F2
Michael Jackson  0.164060  0.248037
Clint Black     -0.207666  1.421081
Dropdead         0.882355  0.436072
Anti-Cimex       1.569998 -0.429204
Cardi B          0.570041  0.670451

In [64]:
from sklearn.metrics import mean_squared_error

X1 = if_df.dropna(subset = ['Alfred'])[['F1', 'F2']]
X2 = if_df2.dropna(subset = ['Alfred'])[['F1', 'F2']]
y = if_df['Alfred'].dropna()
lr1 = LinearRegression().fit(X1, y)
mse1 = mean_squared_error(y, lr1.predict(X1))
lr2 = LinearRegression().fit(X2, y)
mse2 = mean_squared_error(y, lr2.predict(X2))
ans6 = 'if_df2' if mse2 < mse1 else 'if_df'

ans6

'if_df'